In [5]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//DGS10(10 years).csv",header=None) #relative path represented as ..
data3.columns=['Date3','DSG(10 year)']
print(data3.columns)

Index(['Date3', 'DSG(10 year)'], dtype='object')

In [6]:
#removed the uncessary 0th index row
data3=data3.drop(index=[0])
data3

            Date3 DSG(10 year)
1      1962-01-02         4.06
2      1962-01-03         4.03
3      1962-01-04         3.99
4      1962-01-05         4.02
5      1962-01-08         4.03
...           ...          ...
16424  2024-12-13         4.40
16425  2024-12-16         4.39
16426  2024-12-17         4.40
16427  2024-12-18         4.50
16428  2024-12-19         4.57

[16428 rows x 2 columns]

In [7]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['DSG(10 year)']=pd.to_numeric(data3['DSG(10 year)'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

           Date3  DSG(10 year)
1     1962-01-02          4.06
2     1962-01-03          4.03
3     1962-01-04          3.99
4     1962-01-05          4.02
5     1962-01-08          4.03
...          ...           ...
16424 2024-12-13          4.40
16425 2024-12-16          4.39
16426 2024-12-17          4.40
16427 2024-12-18          4.50
16428 2024-12-19          4.57

[16428 rows x 2 columns]

In [8]:
data3.set_index('Date3',inplace=True) 
quarterly3=data3.resample('QE').mean() 
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3  DSG(10 year)
0   1962-03-31      4.016290
1   1962-06-30      3.875714
2   1962-09-30      3.989524
3   1962-12-31      3.902459
4   1963-03-31      3.892131
..         ...           ...
247 2023-12-31      4.447097
248 2024-03-31      4.156393
249 2024-06-30      4.448730
250 2024-09-30      3.954687
251 2024-12-31      4.237273

[252 rows x 2 columns]

In [9]:
quarterly3.to_csv("DSG(10 year).csv", index=False)

In [10]:
quarterly3

         Date3  DSG(10 year)
0   1962-03-31      4.016290
1   1962-06-30      3.875714
2   1962-09-30      3.989524
3   1962-12-31      3.902459
4   1963-03-31      3.892131
..         ...           ...
247 2023-12-31      4.447097
248 2024-03-31      4.156393
249 2024-06-30      4.448730
250 2024-09-30      3.954687
251 2024-12-31      4.237273

[252 rows x 2 columns]